red_ball
red_box
red_key
red_door
locked_closed_red_door
unlocked_closed_red_door
unlocked_open_red_door
green_ball
green_box
green_key
green_door
locked_closed_green_door
unlocked_closed_green_door
unlocked_open_green_door
blue_ball
blue_box
blue_key
blue_door
locked_closed_blue_door
unlocked_closed_blue_door
unlocked_open_blue_door
purple_ball
purple_box
purple_key
purple_door
locked_closed_purple_door
unlocked_closed_purple_door
unlocked_open_purple_door
yellow_ball
yellow_box
yellow_key
yellow_door
locked_closed_yellow_door
unlocked_closed_yellow_door
unlocked_open_yellow_door
grey_ball
grey_box
grey_key
grey_door
locked_closed_grey_door
unlocked_closed_grey_door
unlocked_open_grey_door
red_ball_to_the_left
green_ball_to_the_left
blue_ball_to_the_left
purple_ball_to_the_left
yellow_ball_to_the_left
grey_ball_to_the_left
red_ball_to_the_front
green_ball_to_the_front
blue_ball_to_the_front
purple_ball_to_the_front
yellow_ball_to_the_front
grey_ball_to_the_front
red_ball_to_the_right
green_ball_to_the_right
blue_ball_to_the_right
purple_ball_to_the_right
yellow_ball_to_the_right
grey_ball_to_the_right
red_ball_to_the_far_left
green_ball_to_the_far_left
blue_ball_to_the_far_left
purple_ball_to_the_far_left
yellow_ball_to_the_far_left
grey_ball_to_the_far_left
red_ball_to_the_front_left
green_ball_to_the_front_left
blue_ball_to_the_front_left
purple_ball_to_the_front_left
yellow_ball_to_the_front_left
grey_ball_to_the_front_left
red_ball_to_the_far_front
green_ball_to_the_far_front
blue_ball_to_the_far_front
purple_ball_to_the_far_front
yellow_ball_to_the_far_front
grey_ball_to_the_far_front
red_ball_to_the_front_right
green_ball_to_the_front_right
blue_ball_to_the_front_right
purple_ball_to_the_front_right
yellow_ball_to_the_front_right
grey_ball_to_the_front_right
red_ball_to_the_far_right
green_ball_to_the_far_right
blue_ball_to_the_far_right
purple_ball_to_the_far_right
yellow_ball_to_the_far_right
grey_ball_to_the_far_right
red_box_to_the_left
green_box_to_the_left
blue_box_to_the_left
purple_box_to_the_left
yellow_box_to_the_left
grey_box_to_the_left
red_box_to_the_front
green_box_to_the_front
blue_box_to_the_front
purple_box_to_the_front
yellow_box_to_the_front
grey_box_to_the_front
red_box_to_the_right
green_box_to_the_right
blue_box_to_the_right
purple_box_to_the_right
yellow_box_to_the_right
grey_box_to_the_right
red_box_to_the_far_left
green_box_to_the_far_left
blue_box_to_the_far_left
purple_box_to_the_far_left
yellow_box_to_the_far_left
grey_box_to_the_far_left
red_box_to_the_front_left
green_box_to_the_front_left
blue_box_to_the_front_left
purple_box_to_the_front_left
yellow_box_to_the_front_left
grey_box_to_the_front_left
red_box_to_the_far_front
green_box_to_the_far_front
blue_box_to_the_far_front
purple_box_to_the_far_front
yellow_box_to_the_far_front
grey_box_to_the_far_front
red_box_to_the_front_right
green_box_to_the_front_right
blue_box_to_the_front_right
purple_box_to_the_front_right
yellow_box_to_the_front_right
grey_box_to_the_front_right
red_box_to_the_far_right
green_box_to_the_far_right
blue_box_to_the_far_right
purple_box_to_the_far_right
yellow_box_to_the_far_right
grey_box_to_the_far_right
red_key_to_the_left
green_key_to_the_left
blue_key_to_the_left
purple_key_to_the_left
yellow_key_to_the_left
grey_key_to_the_left
red_key_to_the_front
green_key_to_the_front
blue_key_to_the_front
purple_key_to_the_front
yellow_key_to_the_front
grey_key_to_the_front
red_key_to_the_right
green_key_to_the_right
blue_key_to_the_right
purple_key_to_the_right
yellow_key_to_the_right
grey_key_to_the_right
red_key_to_the_far_left
green_key_to_the_far_left
blue_key_to_the_far_left
purple_key_to_the_far_left
yellow_key_to_the_far_left
grey_key_to_the_far_left
red_key_to_the_front_left
green_key_to_the_front_left
blue_key_to_the_front_left
purple_key_to_the_front_left
yellow_key_to_the_front_left
grey_key_to_the_front_left
red_key_to_the_far_front
green_key_to_the_far_front
blue_key_to_the_far_front
purple_key_to_the_far_front
yellow_key_to_the_far_front
grey_key_to_the_far_front
red_key_to_the_front_right
green_key_to_the_front_right
blue_key_to_the_front_right
purple_key_to_the_front_right
yellow_key_to_the_front_right
grey_key_to_the_front_right
red_key_to_the_far_right
green_key_to_the_far_right
blue_key_to_the_far_right
purple_key_to_the_far_right
yellow_key_to_the_far_right
grey_key_to_the_far_right
locked_closed_red_door_to_the_left
unlocked_closed_red_door_to_the_left
unlocked_open_red_door_to_the_left
locked_closed_green_door_to_the_left
unlocked_closed_green_door_to_the_left
unlocked_open_green_door_to_the_left
locked_closed_blue_door_to_the_left
unlocked_closed_blue_door_to_the_left
unlocked_open_blue_door_to_the_left
locked_closed_purple_door_to_the_left
unlocked_closed_purple_door_to_the_left
unlocked_open_purple_door_to_the_left
locked_closed_yellow_door_to_the_left
unlocked_closed_yellow_door_to_the_left
unlocked_open_yellow_door_to_the_left
locked_closed_grey_door_to_the_left
unlocked_closed_grey_door_to_the_left
unlocked_open_grey_door_to_the_left
locked_closed_red_door_to_the_front
unlocked_closed_red_door_to_the_front
unlocked_open_red_door_to_the_front
locked_closed_green_door_to_the_front
unlocked_closed_green_door_to_the_front
unlocked_open_green_door_to_the_front
locked_closed_blue_door_to_the_front
unlocked_closed_blue_door_to_the_front
unlocked_open_blue_door_to_the_front
locked_closed_purple_door_to_the_front
unlocked_closed_purple_door_to_the_front
unlocked_open_purple_door_to_the_front
locked_closed_yellow_door_to_the_front
unlocked_closed_yellow_door_to_the_front
unlocked_open_yellow_door_to_the_front
locked_closed_grey_door_to_the_front
unlocked_closed_grey_door_to_the_front
unlocked_open_grey_door_to_the_front
locked_closed_red_door_to_the_right
unlocked_closed_red_door_to_the_right
unlocked_open_red_door_to_the_right
locked_closed_green_door_to_the_right
unlocked_closed_green_door_to_the_right
unlocked_open_green_door_to_the_right
locked_closed_blue_door_to_the_right
unlocked_closed_blue_door_to_the_right
unlocked_open_blue_door_to_the_right
locked_closed_purple_door_to_the_right
unlocked_closed_purple_door_to_the_right
unlocked_open_purple_door_to_the_right
locked_closed_yellow_door_to_the_right
unlocked_closed_yellow_door_to_the_right
unlocked_open_yellow_door_to_the_right
locked_closed_grey_door_to_the_right
unlocked_closed_grey_door_to_the_right
unlocked_open_grey_door_to_the_right
locked_closed_red_door_to_the_far_left
unlocked_closed_red_door_to_the_far_left
unlocked_open_red_door_to_the_far_left
locked_closed_green_door_to_the_far_left
unlocked_closed_green_door_to_the_far_left
unlocked_open_green_door_to_the_far_left
locked_closed_blue_door_to_the_far_left
unlocked_closed_blue_door_to_the_far_left
unlocked_open_blue_door_to_the_far_left
locked_closed_purple_door_to_the_far_left
unlocked_closed_purple_door_to_the_far_left
unlocked_open_purple_door_to_the_far_left
locked_closed_yellow_door_to_the_far_left
unlocked_closed_yellow_door_to_the_far_left
unlocked_open_yellow_door_to_the_far_left
locked_closed_grey_door_to_the_far_left
unlocked_closed_grey_door_to_the_far_left
unlocked_open_grey_door_to_the_far_left
locked_closed_red_door_to_the_front_left
unlocked_closed_red_door_to_the_front_left
unlocked_open_red_door_to_the_front_left
locked_closed_green_door_to_the_front_left
unlocked_closed_green_door_to_the_front_left
unlocked_open_green_door_to_the_front_left
locked_closed_blue_door_to_the_front_left
unlocked_closed_blue_door_to_the_front_left
unlocked_open_blue_door_to_the_front_left
locked_closed_purple_door_to_the_front_left
unlocked_closed_purple_door_to_the_front_left
unlocked_open_purple_door_to_the_front_left
locked_closed_yellow_door_to_the_front_left
unlocked_closed_yellow_door_to_the_front_left
unlocked_open_yellow_door_to_the_front_left
locked_closed_grey_door_to_the_front_left
unlocked_closed_grey_door_to_the_front_left
unlocked_open_grey_door_to_the_front_left
locked_closed_red_door_to_the_far_front
unlocked_closed_red_door_to_the_far_front
unlocked_open_red_door_to_the_far_front
locked_closed_green_door_to_the_far_front
unlocked_closed_green_door_to_the_far_front
unlocked_open_green_door_to_the_far_front
locked_closed_blue_door_to_the_far_front
unlocked_closed_blue_door_to_the_far_front
unlocked_open_blue_door_to_the_far_front
locked_closed_purple_door_to_the_far_front
unlocked_closed_purple_door_to_the_far_front
unlocked_open_purple_door_to_the_far_front
locked_closed_yellow_door_to_the_far_front
unlocked_closed_yellow_door_to_the_far_front
unlocked_open_yellow_door_to_the_far_front
locked_closed_grey_door_to_the_far_front
unlocked_closed_grey_door_to_the_far_front
unlocked_open_grey_door_to_the_far_front
locked_closed_red_door_to_the_front_right
unlocked_closed_red_door_to_the_front_right
unlocked_open_red_door_to_the_front_right
locked_closed_green_door_to_the_front_right
unlocked_closed_green_door_to_the_front_right
unlocked_open_green_door_to_the_front_right
locked_closed_blue_door_to_the_front_right
unlocked_closed_blue_door_to_the_front_right
unlocked_open_blue_door_to_the_front_right
locked_closed_purple_door_to_the_front_right
unlocked_closed_purple_door_to_the_front_right
unlocked_open_purple_door_to_the_front_right
locked_closed_yellow_door_to_the_front_right
unlocked_closed_yellow_door_to_the_front_right
unlocked_open_yellow_door_to_the_front_right
locked_closed_grey_door_to_the_front_right
unlocked_closed_grey_door_to_the_front_right
unlocked_open_grey_door_to_the_front_right
locked_closed_red_door_to_the_far_right
unlocked_closed_red_door_to_the_far_right
unlocked_open_red_door_to_the_far_right
locked_closed_green_door_to_the_far_right
unlocked_closed_green_door_to_the_far_right
unlocked_open_green_door_to_the_far_right
locked_closed_blue_door_to_the_far_right
unlocked_closed_blue_door_to_the_far_right
unlocked_open_blue_door_to_the_far_right
locked_closed_purple_door_to_the_far_right
unlocked_closed_purple_door_to_the_far_right
unlocked_open_purple_door_to_the_far_right
locked_closed_yellow_door_to_the_far_right
unlocked_closed_yellow_door_to_the_far_right
unlocked_open_yellow_door_to_the_far_right
locked_closed_grey_door_to_the_far_right
unlocked_closed_grey_door_to_the_far_right
unlocked_open_grey_door_to_the_far_right
wall_to_the_left
wall_to_the_front
wall_to_the_right
wall_to_the_far_left
wall_to_the_front_left
wall_to_the_far_front
wall_to_the_front_right
wall_to_the_far_right
Room1
Room2
Room3
Room4
Room5
Room6
Room7
Room8
Room9
Room1_to_the_right
Room2_to_the_right
Room3_to_the_right
Room4_to_the_right
Room5_to_the_right
Room6_to_the_right
Room7_to_the_right
Room8_to_the_right
Room9_to_the_right
Room1_to_the_behind
Room2_to_the_behind
Room3_to_the_behind
Room4_to_the_behind
Room5_to_the_behind
Room6_to_the_behind
Room7_to_the_behind
Room8_to_the_behind
Room9_to_the_behind
Room1_to_the_left
Room2_to_the_left
Room3_to_the_left
Room4_to_the_left
Room5_to_the_left
Room6_to_the_left
Room7_to_the_left
Room8_to_the_left
Room9_to_the_left
Room1_to_the_front
Room2_to_the_front
Room3_to_the_front
Room4_to_the_front
Room5_to_the_front
Room6_to_the_front
Room7_to_the_front
Room8_to_the_front
Room9_to_the_front
red_door_to_Room1
green_door_to_Room1
blue_door_to_Room1
purple_door_to_Room1
yellow_door_to_Room1
grey_door_to_Room1
red_door_to_Room2
green_door_to_Room2
blue_door_to_Room2
purple_door_to_Room2
yellow_door_to_Room2
grey_door_to_Room2
red_door_to_Room3
green_door_to_Room3
blue_door_to_Room3
purple_door_to_Room3
yellow_door_to_Room3
grey_door_to_Room3
red_door_to_Room4
green_door_to_Room4
blue_door_to_Room4
purple_door_to_Room4
yellow_door_to_Room4
grey_door_to_Room4
red_door_to_Room5
green_door_to_Room5
blue_door_to_Room5
purple_door_to_Room5
yellow_door_to_Room5
grey_door_to_Room5
red_door_to_Room6
green_door_to_Room6
blue_door_to_Room6
purple_door_to_Room6
yellow_door_to_Room6
grey_door_to_Room6
red_door_to_Room7
green_door_to_Room7
blue_door_to_Room7
purple_door_to_Room7
yellow_door_to_Room7
grey_door_to_Room7
red_door_to_Room8
green_door_to_Room8
blue_door_to_Room8
purple_door_to_Room8
yellow_door_to_Room8
grey_door_to_Room8
red_door_to_Room9
green_door_to_Room9
blue_door_to_Room9
purple_door_to_Room9
yellow_door_to_Room9
grey_door_to_Room9
You
